# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [3]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [5]:
my_series = pd.Series(lst)

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [6]:
print(my_series[2])

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [8]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [9]:
my_df = pd.DataFrame(b)
print(my_df)

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [7]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [10]:
my_df.columns =[ "first", "second", "third", "fourth", "fifth"  ]
print(my_df)

   first  second  third  fourth  fifth
0   53.1    95.0   67.5    35.0   78.4
1   61.3    40.8   30.8    37.8   87.6
2   20.6    73.2   44.2    14.6   91.8
3   57.4     0.1   96.1     4.2   69.5
4   83.6    20.5   85.4    22.8   35.9
5   49.0    69.0    0.1    31.8   89.1
6   23.3    40.7   95.0    83.8   26.9
7   27.6    26.4   53.8    88.8   68.5
8   96.6    96.4   53.4    72.4   50.1
9   73.7    39.0   43.2    81.6   34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [14]:
my_df[["first", "third","fifth"]]

   first  third  fifth
0   53.1   67.5   78.4
1   61.3   30.8   87.6
2   20.6   44.2   91.8
3   57.4   96.1   69.5
4   83.6   85.4   35.9
5   49.0    0.1   89.1
6   23.3   95.0   26.9
7   27.6   53.8   68.5
8   96.6   53.4   50.1
9   73.7   43.2   34.7

### 7. From the original data frame, calculate the average Score_3 value.

In [15]:
print(my_df["third"].mean())

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [17]:
print(my_df["fourth"].max())

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [19]:
print(my_df["second"].median())

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [22]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [23]:
df2 = pd.DataFrame(orders)
df2

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [26]:
total_quantity = df2["Quantity"].sum()
print("the total quantity is",total_quantity)

total_revenue = df2["Revenue"].sum()
print("the total revenue is",total_revenue)

the total quantity is 2978
the total revenue is 637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [27]:
max_price = df2["UnitPrice"].max()
min_price = df2["UnitPrice"].min()
diffrence = max_price - min_price
print("the diffrence between the max and min price is",diffrence)

the diffrence between the max and min price is 11.77

## Let's load another dataset for more exercisesÂº

In [30]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')

Let's evaluate the dataset by looking at the `head` function.

In [31]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [33]:
missing_admissions=admissions.isna().sum()
print(missing_admissions>0)

Serial No.           False
GRE Score            False
TOEFL Score          False
University Rating    False
SOP                  False
LOR                  False
CGPA                 False
Research             False
Chance of Admit      False
dtype: bool

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [43]:
for idx in admissions["Serial No."]:
    idx= "id"+str(idx) 
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
id0,idid0,337,118,4,4.5,4.5,9.65,1,0.92
id1,idid1,316,104,3,3.0,3.5,8.00,1,0.72
id2,idid2,322,110,3,3.5,2.5,8.67,1,0.80
id3,idid3,314,103,2,2.0,3.0,8.21,0,0.65
id4,idid4,330,115,5,4.5,3.0,9.34,1,0.90

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [46]:
counts_CGPA = 0
for i in admissions["CGPA"]:
    if i > 9:
        counts_CGPA += 1

print("the number of rows with a CGPA higher than 9 is",counts_CGPA)

the number of rows with a CGPA higher than 9 is 110

### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [57]:
filtered_df = admissions[admissions["CGPA"] > 9] 
final_df = filtered_df[filtered_df["SOP"] < 3.5]
print(final_df["Chance of Admit "].mean())

0.8019999999999999